import pandas as pd

icon = pd.read_csv('icon.csv')

icon_a = icon[icon['category'] == 'A']
text_a = {
         '재밌다': ['재밌다', '신난다', '즐겁다', '기쁘다'],
         '행복하다': ['행복하다', '소중하다', '고맙다', '사랑하다', '좋다'],
         '놀라다': ['놀라다', '충격받다', '신기하다'],
         '뿌듯하다': ['뿌듯하다', '자랑스럽다', '감격스럽다', '만족스럽다', '흐뭇하다'],
         '기대되다': ['기대되다', '설레다'],
         '긴장되다': ['긴장되다', '겁나다', '무섭다', '두렵다', '걱정하다'],
         '실망하다': ['실망하다', '답답하다', '후회된다', '서운하다', '싫다'],
         '화나다': ['화나다', '짜증난다', '억울하다', '분하다', '어이없다'],
         '외롭다': ['외롭다', '슬프다'],
         '피곤하다': ['피곤하다', '지루하다', '졸리다'],
         '민망하다': ['민망하다', '창피하다', '어색하다'],
         '아쉽다': ['아쉽다', '부럽다'],
         '아프다': ['아프다', '힘들다']
    }
icon_text_a = pd.DataFrame()



'''
'재밌다', '신난다', '즐겁다', '기쁘다'
'행복하다', '소중하다', '고맙다', '사랑하다'
'놀라다', '충격받다', '신기하다'
'뿌듯하다', '자랑스럽다', '감격스럽다', '만족스럽다', '흐뭇하다'
'기대되다', '설레다'
'긴장되다', '겁나다', '무섭다', '두렵다', '걱정하다'
'실망하다', '답답하다', '후회된다', '서운하다'
'짜증난다', '억울하다', '분하다', '어이없다'
'외롭다', '슬프다'
'피곤하다', '지루하다', '졸리다'
'민망하다', '창피하다', '어색하다'
'아쉽다', '부럽다'
'아프다', '힘들다'
'''